"""
Задача №1
Ввод с клавиатуры. Если строка введённая с клавиатуры –
это числа, то поделить первое на второе. ȁбработать
ошибку деления на ноль. Если второе число 0, то
программа запрашивает ввод чисел заново. ȅакже если
были введены буквы, то обработать исключение.
"""


def func():
    try:
        num_1 = int(input("Введите число 1"))
        num_2 = int(input("Введите число 2"))
        rez = num_1 / num_2
        return rez
    except ZeroDivisionError:
        print("Деление на 0")
        func()
    except ValueError:
        return "Введены буквы"


print(func())
